# Built In Failures Rebar Failures Inverted 3d Shape Property

Source: https://www.revitapidocs.com/2026/1053163b-b426-2147-ffd6-9c74618e369b.htm

---

| Built In Failures Rebar Failures Inverted 3d Shape Property |
| --- |

**Note: This API is now obsolete.**

The Rebar Shape XX cannot be inverted.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This value is deprecated in Revit 2026 and may be removed in a later version of Revit.")]
public static FailureDefinitionId Inverted3dShape { get; }
```

```
<ObsoleteAttribute("This value is deprecated in Revit 2026 and may be removed in a later version of Revit.")>
Public Shared ReadOnly Property Inverted3dShape As FailureDefinitionId
	Get
```

```
public:
[ObsoleteAttribute(L"This value is deprecated in Revit 2026 and may be removed in a later version of Revit.")]
static property FailureDefinitionId^ Inverted3dShape {
	FailureDefinitionId^ get ();
}
```

```
[<ObsoleteAttribute("This value is deprecated in Revit 2026 and may be removed in a later version of Revit.")>]
static member Inverted3dShape : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures RebarFailures Class Autodesk.Revit.DB Namespace